examples/OpenFOAM/3d_pipe/velocity_profile/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          1500;
        startFace       222000;
    }
    wall
    {
        type            wall;
        physicalType    wall;
        nFaces          3000;
        startFace       223500;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          1500;
        startFace       226500;
    }
)

// ************************************************************************* //
